Documents/Списание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Списание</Name>
			<BasedOn>
				<xr:Item>Document.Производство</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>InformationRegister.СведенияОИсследованиях</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтбиравшийПробу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныОтбораПроб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНПА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаслоТехническое</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДляСлужебной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТранспортировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТранспортировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбИдентификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформацияОбИдентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Производство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходНаИспытания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращеноВТЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМасла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВозвратаМасла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пробы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПроб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРозлива</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВеличинаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесПробы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦелиИсследований</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПАНаОтборПроб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПА1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Списание/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыПробы

&НаКлиенте
Процедура ПробыНаименованиеПробОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормы", ЭтаФорма);
	
	КлючЗаписи = Новый Структура;
	КлючЗаписи.Вставить("ОстДата", Объект.Дата);
	КлючЗаписи.Вставить("ОстНоменклатура", ВыбранноеЗначение);
	КлючЗаписи.Вставить("ОстСклад", Объект.Склад);
	// ОткрытьФорму("ОбщаяФорма.ФормаПодбора", КлючЗаписи,,,,,Оп);
	ОткрытьФорму("Документ.Списание.Форма.ФормаПодбораПартии", КлючЗаписи,,,,,Оп);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого ТекущаяСтрока Из Объект.Пробы Цикл
		РеальныйОстаток = ОстаткиНоменклатуры2(Объект.Дата, Объект.Склад, ТекущаяСтрока.НаименованиеПроб, ТекущаяСтрока.НомерПартии);
		Если РеальныйОстаток < ТекущаяСтрока.ВесПробы Тогда
			ТекстСообщения =  СтрШаблон(НСтр("ru='Ошибка. %1 недостаточно на складе'"), ТекущаяСтрока.НаименованиеПроб);
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект), ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(ДополнительныеПараметры) Экспорт
	ВременнаяПеременная = 1; // Сюда надо что-то написать, потому что процедура не может быть пустой, но она должна быть, без нее не работает
КонецПроцедуры

&НаСервере
Функция ОстаткиНоменклатуры2(ОстДата, ОстСклад, ОстНоменклатура, НомерПартии)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ТовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&ОстДата, ) КАК ТовОстатки
	|ГДЕ
	|	ТовОстатки.Склад = &ОстСклад
	|	И ТовОстатки.Номенклатура = &ОстНоменклатура
	|	И ТовОстатки.НомерПартии = &НомерПартии";
	
	Запрос.УстановитьПараметр("ОстДата", ОстДата);
	Запрос.УстановитьПараметр("ОстСклад", ОстСклад);
	Запрос.УстановитьПараметр("ОстНоменклатура", ОстНоменклатура);
	Запрос.УстановитьПараметр("НомерПартии", НомерПартии);
	
	Записи = Запрос.Выполнить().Выбрать();
	Пока Записи.Следующий() Цикл 
		Возврат (Записи.КоличествоОстаток);
	КонецЦикла;
	Возврат 0;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = ОбщегоНазначенияСервер.ПроверкаПраваНаРедактированиеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если Не РезультатЗакрытия = Неопределено Тогда
		Элементы.Пробы.ТекущиеДанные.НаименованиеПроб = РезультатЗакрытия[0].Значение;
		Элементы.Пробы.ТекущиеДанные.ДатаИзготовления = РезультатЗакрытия[5].Значение;
		Элементы.Пробы.ТекущиеДанные.ВеличинаПартии = РезультатЗакрытия[4].Значение; //вот тут косяк
		Элементы.Пробы.ТекущиеДанные.НомерПартии = РезультатЗакрытия[2].Значение;
	КонецЕсли;
	
	ЗначениеВовзратаМасла = ОбщегоНазначенияСервер.ЕстьВозратМасла(Элементы.Пробы.ТекущиеДанные.НаименованиеПроб);
	Если ТипЗнч(ЗначениеВовзратаМасла) <> "Булево" Тогда
		Если ЗначениеВовзратаМасла > 0 Тогда
			ПолуфарикатВозврата = ОбщегоНазначенияСервер.УзнатьПолуфабрикат(Элементы.Пробы.ТекущиеДанные.НаименованиеПроб, Объект.Дата);
			Если ТипЗнч(ЗначениеВовзратаМасла) <> "Булево" Тогда
				Объект.ВидМасла = ПолуфарикатВозврата;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СкладДляВозврата = ОпределитьСкладВозврата(Элементы.Пробы.ТекущиеДанные.НаименованиеПроб, Элементы.Пробы.ТекущиеДанные.НомерПартии, Элементы.Пробы.ТекущиеДанные.ДатаИзготовления);
	Если СкладДляВозврата <> Неопределено Тогда
		Объект.СкладВозвратаМасла = СкладДляВозврата;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьСкладВозврата(Номенклатура, НомерПартии, ДатаПартии)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Производство.СкладСписанияСырья КАК СкладСписанияСырья
		|ИЗ
		|	РегистрНакопления.Остатки.Обороты КАК ОстаткиОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Производство КАК Производство
		|		ПО ОстаткиОбороты.Номенклатура = Производство.ВидПродукции
		|			И ОстаткиОбороты.НомерПартии = Производство.НомерПартии
		|			И ОстаткиОбороты.ДатаВыпуска = Производство.ДатаРозлива
		|ГДЕ
		|	ОстаткиОбороты.Номенклатура = &Номенклатура
		|	И ОстаткиОбороты.НомерПартии = &НомерПартии
		|	И ОстаткиОбороты.ДатаВыпуска = &ДатаВыпуска";
	
	Запрос.УстановитьПараметр("ДатаВыпуска", ДатаПартии);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НомерПартии", НомерПартии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СкладСписанияСырья;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции
#КонецОбласти
